notes/meeting_2022sep11.org
* meeting notes September 11, 2022
** the raku study group
**** usual links
***** these notes
****** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022sep11.md
***** code examples
****** https://github.com/doomvox/raku-study/tree/main/bin/sep11

** current topics

*** stale perl code and the programmers who can't let go
**** my image publication stopgap measures


*** many unix utils have some form of -0
**** 
#+BEGIN_SRC sh
find TreeAlpha -type f -print0 | xargs -0 egrep godzilla
#+END_SRC

**** Does Raku/rakudo have a -0? Is it needed? Bruce gray solution:
***** 
#+BEGIN_SRC sh
find . -print0 | raku -ne 'BEGIN $*IN.nl-in = "\0"; .say;'
#+END_SRC

*** IntStr vs my Numesque subset
**** subset Numesque of Any where { defined .Numeric };
**** things typed as IntStr won't accept Int or Str
**** IntStr(Cool) does weird things (LTA errors)
**** I defend the use: "strong" typing for perl-damaged brains

**** related subject:
***** https://www.youtube.com/watch?v=1-KV8oiOSZA&t=2s
***** Playing nice with others using the new COERCE protocol - Matthew Stuckwisch
****** https://vrurg.github.io/2020/11/16/Report-On-New-Coercions
****** https://vrurg.github.io/2020/11/30/Report-On-New-Coercions-Part-2
****** https://vrurg.github.io/2020/12/26/Coercion-Return-Values


*** Checking lists of numbers (in arrays) for equality
**** 
#+BEGIN_SRC raku
die unless ( @a »==« @b ).all.so
#+END_SRC
**** 
#+BEGIN_SRC raku
die "Failed" unless @pcp.head(20).join(',') eq @exp.join(',');
#+END_SRC



** additional topics, for someday
*** TODO raku for data science  
**** gradual types for gradually cleaning up data
**** https://p6steve.wordpress.com/2022/07/24/is-raku-dan-rubbersonic/

*** TODO william michels, corrupt json handling
**** https://unix.stackexchange.com/questions/706732/deleting-all-text-after-a-specific-string-for-multiple-text-files-in-a-directory/707180#707180

*** Raku conference vids, e.g. jonathan worthington
**** database migrations in raku


** earlier topics

*** Grammar.nqp
**** https://github.com/rakudo/rakudo/blob/master/src/Perl6/Grammar.nqp
***** locally: /home/doom/End/Cave/Raku/Wall/rakudo/gen/moar/Grammar.nqp
**** has some features I'm unfamiliar with, e.g. ":my $blah" inside a grammar
**** had trouble seeing what "token comp_unit" does, exactly

** announcements 
*** September 24th: the next raku study group meeting
*** Some of my Bali vacation pics:
**** http://obsidianrook.com/pics/bali2022
**** (still a little rough)


